Diplom2/src/Documents/УтверждениеГрафикаРабот/УтверждениеГрафикаРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УтверждениеГрафикаРабот</name>
  <registerRecords>InformationRegister.ГрафикРаботы</registerRecords>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Diplom2/src/InformationRegisters/ГрафикРаботы/ГрафикРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГрафикРаботы</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РабочийДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Diplom2/src/Documents/УтверждениеГрафикаРабот/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ГрафикРаботы.Записывать = Истина;
	
	ДеньГрафика = ДатаНачала;
	
	Пока ДеньГрафика<=ДатаОкончания Цикл
		
		Движение = Движения.ГрафикРаботы.Добавить();
		Движение.Дата = ДеньГрафика;
		
		Если ДеньНедели(ДеньГрафика)<6 Тогда
			Движение.РабочийДень = 1;
		Иначе
			Движение.РабочийДень = 0;
		КонецЕсли;
		
		ДеньГрафика = ДеньГрафика + 24*3600;
	КонецЦикла;
	

КонецПроцедуры
